In [2]:
import pandas as pd
df=pd.DataFrame()
print(df)

Empty DataFrame
Columns: []
Index: []

In [11]:
emp=pd.Series(['Uma','Siva','Sindhu','Ravi'])
id=pd.Series([10,20,30,40])
frame={'Emp':emp,'ID':id}
result=pd.DataFrame(frame)
print("\n Series to DataFrame\n")
print(result)

 Series to DataFrame

      Emp  ID
0     Uma  10
1    Siva  20
2  Sindhu  30
3    Ravi  40

In [15]:
print("\n Extracting One Column  \n")
print(result['Emp'])

 Extracting One Column

0       Uma
1      Siva
2    Sindhu
3      Ravi
Name: Emp, dtype: object

In [17]:
result['Age']=pd.Series([20,25,30,50])
print(result)

      Emp  ID  Age
0     Uma  10   20
1    Siva  20   25
2  Sindhu  30   30
3    Ravi  40   50

In [18]:
del result['Age']
print(result)

      Emp  ID
0     Uma  10
1    Siva  20
2  Sindhu  30
3    Ravi  40

In [24]:
print("Extracting the Second Row \n")
print(result.loc[1])

Extracting the Second Row

Emp    Siva
ID       20
Name: 1, dtype: object

In [27]:
print("Slice Rows\n")
result[1:3]

Slice Rows

      Emp  ID
1    Siva  20
2  Sindhu  30

In [39]:
a2=pd.DataFrame([['Anu',20],['Vinu',19]],columns=['Emp','ID'])
print("\n Adding new row values \n\n",pd.concat([result,a2]))

 Adding new row values

       Emp  ID
0     Uma  10
1    Siva  20
2  Sindhu  30
3    Ravi  40
0     Anu  20
1    Vinu  19

In [40]:
print(result.drop(2))

    Emp  ID
0   Uma  10
1  Siva  20
3  Ravi  40